{
  "giftsets": [
    {
      "id": 64,
      "title": "Coral Elegance",
      "sku": "SKUDYNEGS001",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Subtle diamond weave",
      "description": "A testament to timeless refinement, The Coral Elegance pairs a finely woven microfibre necktie with a matching pocket square and bold, elegant cufflinks. Crafted for the modern gentleman who honors tradition, this set delivers a statement of understated power and enduring class.",
      "styleGuide": "Best paired with a black or dark grey blazer and a light pastel shirt for a bold, sophisticated look. For a sleek, modern style without a blazer, a crisp black shirt complements the coral tones beautifully.",
      "image": "/images/Aproducts/2Giftset/box/Coral Elegance.jpg",
      "color": "coral",
      "isNew": true
    },
    {
      "id": 65,
      "title": "Rosewood Majesty",
      "sku": "SKUDYNEGS002",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Geometric Overlapping Squares",
      "description": "A celebration of classic elegance, the Rosewood Majesty set brings together a finely textured microfibre necktie, a matching pocket square, and sleek rose gold striped cufflinks. Designed for the gentleman with a taste for distinction, this ensemble makes a confident yet refined statement at every occasion.",
      "styleGuide": "Best paired with a deep navy or charcoal blazer and a crisp white shirt for an elevated, polished look. For a more contemporary feel without a blazer, pair it with a tailored black shirt to enhance the richness of the rosewood tones.",
      "image": "/images/Aproducts/2Giftset/box/Rosewood Majesty.jpg",
      "color": "rosewood",
      "isNew": false
    },
    {
      "id": 66,
      "title": "Serene Paisley",
      "sku": "SKUDYNEGS003",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Classic Paisley Weave",
      "description": "A tribute to timeless sophistication, the Serene Paisley set showcases a finely detailed microfibre necktie, an elegantly matching pocket square, and striking black cufflinks. Crafted for those who appreciate subtle opulence, this set captures an air of relaxed luxury and enduring grace.",
      "styleGuide": "Best paired with a light grey or navy blue blazer and a crisp white or soft pastel shirt for a distinguished, polished ensemble. For a more relaxed yet refined look without a blazer, pair it with a soft powder blue or classic white shirt to enhance the delicate hues of the set.",
      "image": "/images/Aproducts/2Giftset/box/Serene Paisley.jpg",
      "color": "navy",
      "isNew": true
    },
    {
      "id": 67,
      "title": "Azure Prism",
      "sku": "SKUDYNEGS004",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 2,
      "pattern": "Geometric square-in-square weave",
      "description": "The Azure Prism set speaks to the bold and modern gentleman, combining a vibrant microfibre necktie, a coordinated pocket square, and distinguished rose gold cufflinks. This ensemble is crafted to embody contemporary style with a nod to timeless sophistication, making it an ideal choice for those who aren't afraid to stand out with elegance.",
      "styleGuide": "Best paired with a navy blue or charcoal grey blazer and a light pastel shirt to highlight the intricate pattern and cool tones. For a sleek, blazer-free look, a crisp white or deep blue shirt will accentuate the vibrant details perfectly.",
      "image": "/images/Aproducts/2Giftset/box/Azure Prism.jpg",
      "color": "azure",
      "isNew": true
    },
    {
      "id": 68,
      "title": "Frosted Whirl",
      "sku": "SKUDYNEGS005",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Intricate Paisley Swirl",
      "description": "Step into refined elegance with the Frosted Whirl set, featuring a microfibre tie and matching pocket square with a beautifully detailed paisley design. Paired with floral blue-and-gold cufflinks, this set perfectly balances subtle luxury with a hint of bold sophistication, ideal for elevating your formalwear.",
      "styleGuide": "Matches exceptionally well with a steel grey or classic black suit for a sharp, polished look. For a more relaxed yet stylish option, pair it with a crisp white shirt and skip the jacket to let the intricate pattern and rich cufflink accents shine.",
      "image": "/images/Aproducts/2Giftset/box/Frosted Whirl.jpg",
      "color": "grey",
      "isNew": false
    },
    {
      "id": 69,
      "title": "Blush Avenue",
      "sku": "SKUDYNEGS006",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 5,
      "pattern": "Bold Striped Contrast",
      "description": "Add a pop of sophistication with the Blush Avenue set, featuring a microfibre tie and matching pocket square adorned in pink, white, and deep navy stripes. The set is finished with modern black and silver cufflinks, giving your outfit a contemporary edge while maintaining timeless charm.",
      "styleGuide": "Best paired with a navy or charcoal suit for a fresh, standout look. For a casual yet sharp statement, combine it with a light grey blazer and white shirt to let the vibrant stripes do all the talking.",
      "image": "/images/Aproducts/2Giftset/box/Blush Avenue.jpg",
      "color": "pink",
      "isNew": true
    },
    {
      "id": 70,
      "title": "Golden Hour",
      "sku": "SKUDYNEGS007",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 5,
      "pattern": "Chevron Shine Texture",
      "description": "Illuminate your look with the Golden Hour set, featuring a glossy chevron-patterned tie and a matching pocket square in a rich, sunlit gold. Complemented by luxurious gold-toned cufflinks with smoky stone accents, this set adds a radiant finish to any outfit.",
      "styleGuide": "Perfect for weddings, cocktail events, or celebrations — pair with a deep navy, dark green, or classic black suit to let the golden tones truly pop.",
      "image": "/images/Aproducts/2Giftset/box/Golden Hour.jpg",
      "color": "gold",
      "isNew": true
    },
    {
      "id": 71,
      "title": "Blush Mosaic",
      "sku": "SKUDYNEGS008",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Micro-Checkered",
      "description": "Stand out with the Blush Mosaic set, featuring a shimmering micro-checkered tie and pocket square in vibrant shades of blush, red, and light grey. Paired with uniquely textured rose gold cufflinks, this set adds playful elegance to formal looks.",
      "styleGuide": "Ideal for daytime weddings, garden parties, or semi-formal events — matches beautifully with grey, charcoal, or cream suits for a lively yet polished impression.",
      "image": "/images/Aproducts/2Giftset/box/Blush Mosaic.jpg",
      "color": "blush",
      "isNew": false
    },
    {
      "id": 72,
      "title": "Midnight Paisley",
      "sku": "SKUJPKDEGS009",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Paisley Embroidery",
      "description": "The Midnight Paisley set brings together a bold black backdrop with intricate swirling blue and blush paisley embroidery, paired with sleek copper toned checkered cufflinks for a powerful, refined statement.",
      "styleGuide": "Best suited for evening events, cocktail parties, or formal dinners — complements black, navy, or even deep maroon suits for a striking, confident look.",
      "image": "/images/Aproducts/2Giftset/box/Midnight Paisley.jpg",
      "color": "black",
      "isNew": true
    },
    {
      "id": 73,
      "title": "Emerald Ivory Elegance",
      "sku": "SKUDYNEGS010",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Paisley",
      "description": "The Emerald Elegance set showcases a luxurious deep green silk base with intricate paisley embroidery, paired with hexagonal silver cufflinks with black pattern for a bold yet classic finish.",
      "styleGuide": "Perfect for winter weddings, formal events, or upscale soirées — pairs impeccably with charcoal grey, black, or deep green suits for a rich, distinguished look.",
      "image": "/images/Aproducts/2Giftset/box/Emerald Ivory Elegance.jpg",
      "color": "green",
      "isNew": false
    },
    {
      "id": 74,
      "title": "Teal Noir",
      "sku": "SKUDYNEGS011",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 4,
      "pattern": "Diagonal Stripes",
      "description": "The Teal Noir set brings a sharp, modern twist with vivid teal and subtle ivory lines against a deep background, finished with sleek, dark-toned cufflinks accented by crystal-like centers.",
      "styleGuide": "Ideal for semi-formal to formal occasions; pair it with gray or black suits to make the teal hues pop effortlessly.",
      "image": "/images/Aproducts/2Giftset/box/Teal Noir.jpg",
      "color": "teal",
      "isNew": true
    },
    {
      "id": 75,
      "title": "Dark Green Fuchsia Paisley",
      "sku": "SKUDYNEGS012",
      "price": 1899,
      "originalPrice": 2799,
      "quantity": 1,
      "pattern": "Paisley",
      "description": "The Dark Green Fuchsia Paisley set captures vibrant energy with rich green tones and lively fuchsia pink paisley patterns, complete with sleek black cufflinks featuring blue and gold intricacies.",
      "styleGuide": "Perfect for weddings, festive events, and evening gatherings; pairs beautifully with black, deep green, or dark grey suits for a bold yet elegant statement.",
      "image": "/images/Aproducts/2Giftset/box/Dark Green Fuchsia Paisley.jpg",
      "color": "green",
      "isNew": false
    },
    {
      "id": 76,
      "title": "Navy Brown Bloom",
      "sku": "SKUDYNEGS013",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 4,
      "pattern": "Floral Brocade",
      "description": "The Navy Brown Bloom set merges deep navy tones with intricate brown floral patterns, creating a refined, textured look, complete with striking blue cufflinks and golden border for a polished finish.",
      "styleGuide": "Perfect for weddings, receptions, and formal evenings; pairs best with navy, brown, or black suits to enhance the elegant contrast of the set.",
      "image": "/images/Aproducts/2Giftset/box/Navy Brown Bloom.jpg",
      "color": "navy",
      "isNew": true
    },
    {
      "id": 77,
      "title": "Aqua Lilac Paisley",
      "sku": "SKUDYNEGS014",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Paisley",
      "description": "The Aqua Lilac Paisley set brings a refreshing play of soft aqua blues and muted lilac tones across an elegant black base, completed with gold-toned cufflinks featuring intricate spiral engravings.",
      "styleGuide": "A standout choice for daytime weddings, receptions, or creative formal events; pairs beautifully with light grey, charcoal, or navy suits for a vibrant yet refined look.",
      "image": "/images/Aproducts/2Giftset/box/Aqua Lilac Paisley.jpg",
      "color": "aqua",
      "isNew": false
    },
    {
      "id": 78,
      "title": "Teal & Green Paisley",
      "sku": "SKUDYNEGS015",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Paisley",
      "description": "The Teal Green Paisley set showcases vibrant teal and green paisley patterns over a dark base, paired with antique gold-toned cufflinks featuring intricate designs for a classic, elegant touch.",
      "styleGuide": "Perfect for formal occasions and evening events; pairs beautifully with black, navy, or deep green suits to highlight the rich teal accents.",
      "image": "/images/Aproducts/2Giftset/box/Teal & Green Paisley.jpg",
      "color": "teal",
      "isNew": true
    },
    {
      "id": 79,
      "title": "Royal Amethyst",
      "sku": "SKUDYNEGS016",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Diagonal Stripes",
      "description": "The Royal Amethyst set dazzles with a rich mix of deep purple and lilac hues, paired with subtle woven details for a touch of sophistication. The ensemble is finished with mother-of-pearl-style cufflinks encased in gold for added elegance.",
      "styleGuide": "Perfect for gala events, weddings, and formal celebrations; pairs beautifully with black, or charcoal suits for a bold yet classy statement.",
      "image": "/images/Aproducts/2Giftset/box/Royal Amethyst.jpg",
      "color": "purple",
      "isNew": false
    },
    {
      "id": 80,
      "title": "Mint Reverie Paisley",
      "sku": "SKUDYNEGS019",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 4,
      "pattern": "Whispered Paisley Brocade",
      "description": "Light, fresh, and effortlessly sophisticated, the Mint Reverie Paisley set infuses your look with a breath of elegance. Detailed swirling patterns on a soft mint canvas, paired with golden, finely etched cufflinks, make this set perfect for spring weddings, garden parties, and daytime celebrations.",
      "styleGuide": "Pairs beautifully with light gray, beige, or classic navy suits for a refined and refreshing ensemble.",
      "image": "/images/Aproducts/2Giftset/box/Mint Reverie Paisley.jpg",
      "color": "mint",
      "isNew": true
    },
    {
      "id": 81,
      "title": "Crimson Royale Brocade",
      "sku": "SKUDYNEGS017",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 4,
      "pattern": "Baroque Floral Brocade",
      "description": "The Crimson Royale Brocade set radiates bold elegance with its intricate, regal patterns woven into rich crimson fabric. Paired with classic dark cufflinks, it offers a dramatic and luxurious finishing touch to any formal outfit.",
      "styleGuide": "Ideal for black-tie events, weddings, or festive occasions; best styled with black, navy, or deep grey suits to let the vibrant red make a statement.",
      "image": "/images/Aproducts/2Giftset/box/Crimson Royale Brocade.jpg",
      "color": "crimson",
      "isNew": false
    },
    {
      "id": 82,
      "title": "Midnight Mirage Paisley",
      "sku": "SKUDYNEGS018",
      "price": 1899,
      "originalPrice": 2799,
      "quantity": 3,
      "pattern": "Paisley Weave",
      "description": "Dive into deep elegance with the Midnight Mirage Paisley set. Shades of blue, indigo, and sapphire swirl in a hypnotic paisley dance, matched with starry cufflinks that add a celestial touch to your formal ensemble.",
      "styleGuide": "Perfect for evening galas, weddings, or any event under the stars; pairs best with charcoal, navy, or black suits for a truly magnetic look.",
      "image": "/images/Aproducts/2Giftset/box/Midnight Mirage Paisley.jpg",
      "color": "blue",
      "isNew": true
    },
    {
      "id": 83,
      "title": "Crimson Checkmate",
      "sku": "SKUDYNEGS020",
      "price": 2799,
      "originalPrice": 3699,
      "quantity": 3,
      "pattern": "Bold Crimson Plaid",
      "description": "Striking a perfect balance between playful and polished, the Crimson Checkmate set features a vibrant plaid design in shades of red and pink. Accompanied by textured black cufflinks, this set is made for those who aren't afraid to stand out at social gatherings, weddings, or semi-formal events.",
      "styleGuide": "Looks sharp with navy, or black suits, bringing a pop of color that's both commanding and stylish.",
      "image": "/images/Aproducts/2Giftset/box/Crimson Checkmate.jpg",
      "color": "red",
      "isNew": false
    }
  ]
} 